packages/stripe_api/test/fixtures/stripe/json/subscription_with_pricing_tiers.json

{
  "id": "sub_1NzOsBHSA9cXarIchHmEjlmc",
  "object": "subscription",
  "application": null,
  "application_fee_percent": null,
  "automatic_tax": {
    "enabled": false
  },
  "billing_cycle_anchor": 1696878731,
  "billing_thresholds": null,
  "cancel_at": null,
  "cancel_at_period_end": false,
  "canceled_at": null,
  "cancellation_details": {
    "comment": null,
    "feedback": null,
    "reason": null
  },
  "collection_method": "charge_automatically",
  "created": 1696878731,
  "currency": "usd",
  "current_period_end": 1699557131,
  "current_period_start": 1696878731,
  "customer": "cus_Omyp1oQqpNqsWQ",
  "days_until_due": null,
  "default_payment_method": "pm_1NzOsAHSA9cXarIcblZrdytw",
  "default_source": null,
  "default_tax_rates": [],
  "description": null,
  "discount": null,
  "ended_at": null,
  "items": {
    "object": "list",
    "data": [
      {
        "id": "si_OmypkJfzhERoOd",
        "object": "subscription_item",
        "billing_thresholds": null,
        "created": 1696878732,
        "metadata": {},
        "plan": {
          "id": "price_1NzOkSHSA9cXarIcvNNb31Ou",
          "object": "plan",
          "active": true,
          "aggregate_usage": null,
          "amount": null,
          "amount_decimal": null,
          "billing_scheme": "tiered",
          "created": 1696878252,
          "currency": "usd",
          "interval": "month",
          "interval_count": 1,
          "livemode": false,
          "metadata": {},
          "nickname": "Teams (Volume)",
          "product": "prod_Nj1EDNMwkkS0xc",
          "tiers_mode": "volume",
          "transform_usage": null,
          "trial_period_days": null,
          "usage_type": "licensed"
        },
        "price": {
          "id": "price_1NzOkSHSA9cXarIcvNNb31Ou",
          "object": "price",
          "active": true,
          "billing_scheme": "tiered",
          "created": 1696878252,
          "currency": "usd",
          "custom_unit_amount": null,
          "livemode": false,
          "lookup_key": null,
          "metadata": {},
          "nickname": "Teams (Volume)",
          "product": "prod_Nj1EDNMwkkS0xc",
          "recurring": {
            "aggregate_usage": null,
            "interval": "month",
            "interval_count": 1,
            "trial_period_days": null,
            "usage_type": "licensed"
          },
          "tax_behavior": "exclusive",
          "tiers": [
            {
              "flat_amount": 2000,
              "flat_amount_decimal": "2000",
              "unit_amount": null,
              "unit_amount_decimal": null,
              "up_to": 50000
            },
            {
              "flat_amount": 10000,
              "flat_amount_decimal": "10000",
              "unit_amount": null,
              "unit_amount_decimal": null,
              "up_to": 300000
            },
            {
              "flat_amount": 30000,
              "flat_amount_decimal": "30000",
              "unit_amount": null,
              "unit_amount_decimal": null,
              "up_to": 1000000
            },
            {
              "flat_amount": 70000,
              "flat_amount_decimal": "70000",
              "unit_amount": null,
              "unit_amount_decimal": null,
              "up_to": 2500000
            },
            {
              "flat_amount": 125000,
              "flat_amount_decimal": "125000",
              "unit_amount": null,
              "unit_amount_decimal": null,
              "up_to": 5000000
            },
            {
              "flat_amount": 200000,
              "flat_amount_decimal": "200000",
              "unit_amount": null,
              "unit_amount_decimal": null,
              "up_to": 10000000
            },
            {
              "flat_amount": 500000,
              "flat_amount_decimal": "500000",
              "unit_amount": null,
              "unit_amount_decimal": null,
              "up_to": null
            }
          ],
          "tiers_mode": "volume",
          "transform_quantity": null,
          "type": "recurring",
          "unit_amount": null,
          "unit_amount_decimal": null
        },
        "quantity": 2000000,
        "subscription": "sub_1NzOsBHSA9cXarIchHmEjlmc",
        "tax_rates": []
      }
    ],
    "has_more": false,
    "total_count": 1,
    "url": "/v1/subscription_items?subscription=sub_1NzOsBHSA9cXarIchHmEjlmc"
  },
  "latest_invoice": "in_1NzOsBHSA9cXarIcfpuFJuwh",
  "livemode": false,
  "metadata": {},
  "next_pending_invoice_item_invoice": null,
  "on_behalf_of": null,
  "pause_collection": null,
  "payment_settings": {
    "payment_method_options": null,
    "payment_method_types": null,
    "save_default_payment_method": "off"
  },
  "pending_invoice_item_interval": null,
  "pending_setup_intent": null,
  "pending_update": null,
  "plan": {
    "id": "price_1NzOkSHSA9cXarIcvNNb31Ou",
    "object": "plan",
    "active": true,
    "aggregate_usage": null,
    "amount": null,
    "amount_decimal": null,
    "billing_scheme": "tiered",
    "created": 1696878252,
    "currency": "usd",
    "interval": "month",
    "interval_count": 1,
    "livemode": false,
    "metadata": {},
    "nickname": "Teams (Volume)",
    "product": "prod_Nj1EDNMwkkS0xc",
    "tiers_mode": "volume",
    "transform_usage": null,
    "trial_period_days": null,
    "usage_type": "licensed"
  },
  "quantity": 2000000,
  "schedule": null,
  "start_date": 1696878731,
  "status": "active",
  "test_clock": null,
  "transfer_data": null,
  "trial_end": null,
  "trial_settings": {
    "end_behavior": {
      "missing_payment_method": "create_invoice"
    }
  },
  "trial_start": null
}
